EmailUrlInfo  
| where Url contains "https://login.windows.net/common/oauth2" or Url contains "https://login.microsoftonline.com/consumers/oauth2" 
| where Url contains "redirect_uri"
| join EmailEvents  on $left.NetworkMessageId == $right.NetworkMessageId
| where EmailDirection == "Inbound"
